Revit 2027 API
BoundingBoxIsInsideFilter(Outline) Constructor
 Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxIsInsideFilter(
	Outline outline
)
Public Sub New (
	outline As Outline
)
public:
BoundingBoxIsInsideFilter(
	Outline^ outline
)
new :
        outline : Outline -> BoundingBoxIsInsideFilter
Parameters
outline Outline
 The Outline used to find elements with a bounding box that are contained by it.
Exceptions
Exception | Condition
ArgumentException |  outline is an empty Outline.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BoundingBoxIsInsideFilter Class
BoundingBoxIsInsideFilter Overload
Autodesk.Revit.DB Namespace